In [19]:
"""31:00 / 1:05:23"""
import pandas as pd

In [20]:
df = pd.read_csv("friends.csv")

In [21]:
df

      name        city  marks
0    Harry      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [24]:
new_df = df.T
new_df

            0        1         2           3        4      5        6
name    Harry    Rohan    Skillf       Shubh    Aamit  Ahmed  Raheman
city   Rampur  Kolkata  Bareilly  Antarctica  Kolkata  Delhi   Mumbai
marks      92       34        24          17       15     14       34

In [25]:
df.to_numpy()

array([['Harry', 'Rampur', 92],
       ['Rohan', 'Kolkata', 34],
       ['Skillf', 'Bareilly', 24],
       ['Shubh', 'Antarctica', 17],
       ['Aamit', 'Kolkata', 15],
       ['Ahmed', 'Delhi', 14],
       ['Raheman', 'Mumbai', 34]], dtype=object)

In [26]:
df.sort_index(axis=0, ascending=False)

      name        city  marks
6  Raheman      Mumbai     34
5    Ahmed       Delhi     14
4    Aamit     Kolkata     15
3    Shubh  Antarctica     17
2   Skillf    Bareilly     24
1    Rohan     Kolkata     34
0    Harry      Rampur     92

In [27]:
df.sort_index(axis=0, ascending=True) #Default

      name        city  marks
0    Harry      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [28]:
new = df["name"]
new

0      Harry
1      Rohan
2     Skillf
3      Shubh
4      Aamit
5      Ahmed
6    Raheman
Name: name, dtype: object

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
type(new)

pandas.core.series.Series